conf_files/DataProcessors/ИмпортСеансовПользователейИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<DataProcessor>
		<Properties>
			<Name>ИмпортСеансовПользователейИнформационныхБаз</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КаталогФайловИмпорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаИмпорта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерСессии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сервер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Серверы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерверОбозначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнформационнаяБаза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПользователя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приложение1С</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Приложения1С</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоСеанса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецСеанса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерверныйИдентификаторПартнера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнформационнаяБазаОбозначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

conf_files/Enums/Приложения1С.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>Приложения1С</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТолстыйКлиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТонкийКлиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WEBКлиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конфигуратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФоновоеЗадание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильныйКлиент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

conf_files/Catalogs/ИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>ИнформационныеБазы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИнформационнойБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конфигурации1С</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Серверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

conf_files/DataProcessors/ИмпортСеансовПользователейИнформационныхБаз/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура КаталогФайловИмпортаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	
	диалогВыбораКаталога = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	диалогВыбораКаталога.МножественныйВыбор = ложь;
	диалогВыбораКаталога.Показать(новый ОписаниеОповещения("ВыбранКаталогИмпорта", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранКаталогИмпорта(ВыбранныеФайлы, ДополнительныеПараметры) экспорт
	
	если ВыбранныеФайлы = неопределено тогда
		возврат;
	конецЕсли;	
	
	если ВыбранныеФайлы.Количество() = 0 тогда
		возврат;
	конецЕсли;	
	
	объект.КаталогФайловИмпорта = ВыбранныеФайлы[0];
	
КонецПроцедуры	

&НаКлиенте
Процедура ПрочитатьФайлы(Команда)
	
	если ПустаяСтрока(объект.КаталогФайловИмпорта) тогда 
		возврат;
	конецЕсли;	
	
	мФайлов = НайтиФайлы(объект.КаталогФайловИмпорта, "*_*_*_*_*_*.json", ложь);
	
	мИменОбрабатываемыхКолонок = новый массив;
	мИменОбрабатываемыхКолонок.Добавить("date");
	мИменОбрабатываемыхКолонок.Добавить("datefrom");
	мИменОбрабатываемыхКолонок.Добавить("dateto");
	мИменОбрабатываемыхКолонок.Добавить("appname");
	
	для каждого файлИмпорта из мФайлов цикл
		чтение_JSON = новый ЧтениеJSON();
		чтение_JSON.ОткрытьФайл(файлИмпорта.ПолноеИмя, "utf8");
		
		необработанныеДанные = ПрочитатьJSON(чтение_JSON,,,, "ПривестиЗначенияJSON", ЭтаФорма,, мИменОбрабатываемыхКолонок);
		чтение_JSON.Закрыть();
		
		для каждого элементДанных из необработанныеДанные цикл
			строкаТаблицы = объект.ТаблицаИмпорта.Добавить();
			строкаТаблицы.дата = элементДанных.date;
			строкаТаблицы.началоСеанса = элементДанных.datefrom;
			строкаТаблицы.конецСеанса = элементДанных.dateto;
			строкаТаблицы.имяПользователя = элементДанных.username;
			строкаТаблицы.приложение1С = элементДанных.appname;
			строкаТаблицы.номерСессии = элементДанных.session;
			строкаТаблицы.серверОбозначение = элементДанных.server;
			строкаТаблицы.серверныйИдентификаторПартнера = элементДанных.partner;
			строкаТаблицы.ИнформационнаяБазаОбозначение = элементДанных.config;
		конецЦикла;
		
	КонецЦикла;	
	
	СопоставитьЗагружаемыеДанные();
	
КонецПроцедуры

&НаКлиенте
Функция ПривестиЗначенияJSON(свойство, значение, дополнительныеПараметры) экспорт
	
	если свойство = "date" или свойство = "datefrom" или свойство = "dateto" тогда
		
		мЧастейДаты = СтрРазделить(значение, " ", ложь);
				
		если мЧастейДаты.Количество() = 2 тогда
			мЧастейВремени = СтрРазделить(мЧастейДаты[1], ":", ложь);
			час = мЧастейВремени[0];
			минута = мЧастейВремени[1];
		иначе
			час = "00";
			минута = "00";
		конецЕсли;	
		
		мЧастейДаты = СтрРазделить(мЧастейДаты[0], "-", ложь);
		год = мЧастейДаты[0];
		месяц = мЧастейДаты[1];
		день = мЧастейДаты[2];
		
		попытка
			возврат дата(число(год), число(месяц), число(день), число(час), число(минута), 0);
		исключение
			возврат неопределено;
		КонецПопытки;	
		
	иначеЕсли свойство = "appname" тогда
		
		имяПриложения = СтрЗаменить(нрег(значение), """", "");
		
		если имяПриложения = "1cv8c" тогда
			возврат ПредопределенноеЗначение("Перечисление.Приложения1С.ТонкийКлиент");
		иначеЕсли имяПриложения = "designer" тогда
			возврат ПредопределенноеЗначение("Перечисление.Приложения1С.Конфигуратор");
		иначеЕсли имяПриложения = "1cv8c" тогда
			возврат ПредопределенноеЗначение("Перечисление.Приложения1С.ТолстыйКлиент");
		иначеЕсли имяПриложения = "backgroundjob" тогда
			возврат ПредопределенноеЗначение("Перечисление.Приложения1С.ФоновоеЗадание");
		иначеЕсли имяПриложения = "webclient" тогда
			возврат ПредопределенноеЗначение("Перечисление.Приложения1С.WEBКлиент");
		иначеЕсли имяПриложения = "mobileclient" тогда
			возврат ПредопределенноеЗначение("Перечисление.Приложения1С.МобильныйКлиент");
		конецЕсли;	
		                                                                               
	конецЕсли;	
	
	возврат значение;
	
КонецФункции	

&НаСервере
Процедура СопоставитьЗагружаемыеДанные()
	
	запрос = новый запрос;
	запрос.текст = "ВЫБРАТЬ
	               |	табСопоставления.СерверныйИдентификаторПартнера + табСопоставления.ИнформационнаяБазаОбозначение КАК СерверныйИдентификаторИнформациннойБазы,
	               |	табСопоставления.НомерСессии КАК НомерСессии,
	               |	табСопоставления.Дата КАК Дата,
	               |	табСопоставления.ИмяПользователя КАК ИмяПользователя,
	               |	табСопоставления.Приложение1С КАК Приложение1С,
	               |	табСопоставления.НачалоСеанса КАК НачалоСеанса,
	               |	табСопоставления.КонецСеанса КАК КонецСеанса,
	               |	табСопоставления.СерверныйИдентификаторПартнера КАК СерверныйИдентификаторПартнера,
	               |	табСопоставления.ИнформационнаяБазаОбозначение КАК ИнформационнаяБазаОбозначение,
	               |	табСопоставления.СерверОбозначение КАК СерверОбозначение
	               |ПОМЕСТИТЬ втТаблицаСопоставления
	               |ИЗ
	               |	&табСопоставления КАК табСопоставления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТаблицаСопоставления.НомерСессии КАК НомерСессии,
	               |	втТаблицаСопоставления.Дата КАК Дата,
	               |	втТаблицаСопоставления.ИмяПользователя КАК ИмяПользователя,
	               |	втТаблицаСопоставления.Приложение1С КАК Приложение1С,
	               |	втТаблицаСопоставления.НачалоСеанса КАК НачалоСеанса,
	               |	втТаблицаСопоставления.КонецСеанса КАК КонецСеанса,
	               |	втТаблицаСопоставления.СерверныйИдентификаторПартнера КАК СерверныйИдентификаторПартнера,
	               |	втТаблицаСопоставления.ИнформационнаяБазаОбозначение КАК ИнформационнаяБазаОбозначение,
	               |	МАКСИМУМ(Серверы.Ссылка) КАК Сервер,
	               |	МАКСИМУМ(ИнформационныеБазы.Ссылка) КАК ИнформационнаяБаза
	               |ИЗ
	               |	втТаблицаСопоставления КАК втТаблицаСопоставления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Серверы КАК Серверы
	               |		ПО втТаблицаСопоставления.СерверОбозначение = Серверы.СерверныйИдентификатор
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнформационныеБазы КАК ИнформационныеБазы
	               |		ПО втТаблицаСопоставления.СерверныйИдентификаторИнформациннойБазы = ИнформационныеБазы.СерверныйИдентификатор
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втТаблицаСопоставления.НомерСессии,
	               |	втТаблицаСопоставления.Дата,
	               |	втТаблицаСопоставления.ИмяПользователя,
	               |	втТаблицаСопоставления.Приложение1С,
	               |	втТаблицаСопоставления.НачалоСеанса,
	               |	втТаблицаСопоставления.КонецСеанса,
	               |	втТаблицаСопоставления.СерверныйИдентификаторПартнера,
	               |	втТаблицаСопоставления.ИнформационнаяБазаОбозначение";
	запрос.УстановитьПараметр("табСопоставления", объект.ТаблицаИмпорта.Выгрузить());
	объект.ТаблицаИмпорта.Загрузить(запрос.Выполнить().Выгрузить());
	
КонецПроцедуры	

&НаКлиенте
Процедура Импортировать(Команда)
	ИмпортироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИмпортироватьНаСервере()
	
	ошибки = неопределено;
	
	обработкаОб = РеквизитФормыВЗначение("Объект");
	таблицаИмпортаЗаполнена = обработкаОб.ТаблицаИмпортаЗаполнена(ошибки);
	
	если таблицаИмпортаЗаполнена тогда
		обработкаОб.Импортировать();
	иначе
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(ошибки);
	конецЕсли;	
	
	
КонецПроцедуры
